# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

print(bin(45).replace("0b",""))

print(bin(3).replace("0b",""))

print(bin(2).replace("0b",""))
