# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

input = numbers = [1, 2, 2, 3, 3, 4, 5]

print(list(set(input)))